In [5]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('../ML100day/datasets/Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [9]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [15]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=["a","b","c","d"])
df

                   a         b         c         d
2013-01-01 -1.906139  0.172153 -0.898541 -0.712946
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685
2013-01-03  1.247540 -0.005403 -0.932813  0.286202
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467
2013-01-05 -0.778965  0.240907 -0.683180  0.407629
2013-01-06  0.495071  1.447766  0.166928  0.096172

In [19]:
df2 = pd.DataFrame({'A': 1.,
                 'B': pd.Timestamp('20130102'),
                 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                 'D': np.array([3] * 4, dtype='int32'),
                 'E': pd.Categorical(["test", "train", "test", "train"]),
                 'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [22]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [24]:
df.values

array([[-1.90613875,  0.1721529 , -0.89854129, -0.7129457 ],
       [-1.012161  ,  1.98605937, -0.94842531, -1.03068477],
       [ 1.24754032, -0.00540294, -0.9328127 ,  0.28620224],
       [-0.2585646 ,  0.21902827, -1.40147857, -1.33646659],
       [-0.77896468,  0.24090729, -0.68318015,  0.40762945],
       [ 0.49507118,  1.44776614,  0.16692836,  0.096172  ]])

In [26]:
df.T.values

array([[-1.90613875, -1.012161  ,  1.24754032, -0.2585646 , -0.77896468,
         0.49507118],
       [ 0.1721529 ,  1.98605937, -0.00540294,  0.21902827,  0.24090729,
         1.44776614],
       [-0.89854129, -0.94842531, -0.9328127 , -1.40147857, -0.68318015,
         0.16692836],
       [-0.7129457 , -1.03068477,  0.28620224, -1.33646659,  0.40762945,
         0.096172  ]])

In [27]:
df

                   a         b         c         d
2013-01-01 -1.906139  0.172153 -0.898541 -0.712946
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685
2013-01-03  1.247540 -0.005403 -0.932813  0.286202
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467
2013-01-05 -0.778965  0.240907 -0.683180  0.407629
2013-01-06  0.495071  1.447766  0.166928  0.096172

In [29]:
df.sort_index(axis=1, ascending=True)

                   a         b         c         d
2013-01-01 -1.906139  0.172153 -0.898541 -0.712946
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685
2013-01-03  1.247540 -0.005403 -0.932813  0.286202
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467
2013-01-05 -0.778965  0.240907 -0.683180  0.407629
2013-01-06  0.495071  1.447766  0.166928  0.096172

In [31]:
df['a']

2013-01-01   -1.906139
2013-01-02   -1.012161
2013-01-03    1.247540
2013-01-04   -0.258565
2013-01-05   -0.778965
2013-01-06    0.495071
Freq: D, Name: a, dtype: float64

In [34]:
df[0:2]

                   a         b         c         d
2013-01-01 -1.906139  0.172153 -0.898541 -0.712946
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685

In [37]:
df.loc[dates[0]]

a   -1.906139
b    0.172153
c   -0.898541
d   -0.712946
Name: 2013-01-01 00:00:00, dtype: float64

In [41]:
df.loc[dates[0], 'a']=1
df.loc[dates[0], 'a']

1.0

In [42]:
df[df.a > 0]

                   a         b         c         d
2013-01-01  1.000000  0.172153 -0.898541 -0.712946
2013-01-03  1.247540 -0.005403 -0.932813  0.286202
2013-01-06  0.495071  1.447766  0.166928  0.096172

In [43]:
df[df > 0]

                   a         b         c         d
2013-01-01  1.000000  0.172153       NaN       NaN
2013-01-02       NaN  1.986059       NaN       NaN
2013-01-03  1.247540       NaN       NaN  0.286202
2013-01-04       NaN  0.219028       NaN       NaN
2013-01-05       NaN  0.240907       NaN  0.407629
2013-01-06  0.495071  1.447766  0.166928  0.096172

In [47]:
df2=df.copy()

In [48]:
df2['e'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   a         b         c         d      e
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three
2013-01-05 -0.778965  0.240907 -0.683180  0.407629   four
2013-01-06  0.495071  1.447766  0.166928  0.096172  three

In [51]:
df2[df2['e'].isin(['two', 'four'])]

                   a         b         c         d     e
2013-01-03  1.247540 -0.005403 -0.932813  0.286202   two
2013-01-05 -0.778965  0.240907 -0.683180  0.407629  four

In [49]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [52]:
df['f'] = s1
df

                   a         b         c         d      e    f
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  NaN
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0
2013-01-05 -0.778965  0.240907 -0.683180  0.407629   four  4.0
2013-01-06  0.495071  1.447766  0.166928  0.096172  three  5.0

In [53]:
s1 = pd.Series([1, 2, 3, 4, 5, 6])
df['g'] = s1
df

                   a         b         c         d      e    f   g
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  NaN NaN
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0 NaN
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0 NaN
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0 NaN
2013-01-05 -0.778965  0.240907 -0.683180  0.407629   four  4.0 NaN
2013-01-06  0.495071  1.447766  0.166928  0.096172  three  5.0 NaN

In [54]:
s1 =[1, 2, 3, 4, 5, 6]
df['g'] = s1
df

                   a         b         c         d      e    f  g
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  NaN  1
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0  2
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0  3
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0  4
2013-01-05 -0.778965  0.240907 -0.683180  0.407629   four  4.0  5
2013-01-06  0.495071  1.447766  0.166928  0.096172  three  5.0  6

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   a         b         c         d      e    f  g   E
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  NaN  1 NaN
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0  2 NaN
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0  3 NaN
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0  4 NaN

In [58]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   a         b         c         d      e    f  g    E
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  NaN  1  1.0
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0  2  1.0
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0  3  NaN
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0  4  NaN

In [59]:
df1.dropna(how='any')

                   a         b         c         d    e    f  g    E
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685  one  1.0  2  1.0

In [60]:
df1.fillna(value=5)

                   a         b         c         d      e    f  g    E
2013-01-01  1.000000  0.172153 -0.898541 -0.712946    one  5.0  1  1.0
2013-01-02 -1.012161  1.986059 -0.948425 -1.030685    one  1.0  2  1.0
2013-01-03  1.247540 -0.005403 -0.932813  0.286202    two  2.0  3  5.0
2013-01-04 -0.258565  0.219028 -1.401479 -1.336467  three  3.0  4  5.0

In [61]:
pd.isna(df1)

                a      b      c      d      e      f      g      E
2013-01-01  False  False  False  False  False   True  False  False
2013-01-02  False  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False  False   True
2013-01-04  False  False  False  False  False  False  False   True

In [84]:
df=df.iloc[:,0:4]

In [64]:
df.mean()

a    0.115487
b    0.676752
c   -0.782918
d   -0.381682
f    3.000000
g    3.500000
dtype: float64

In [65]:
df.mean(axis=1)

2013-01-01    0.112133
2013-01-02    0.332465
2013-01-03    0.932588
2013-01-04    0.703753
2013-01-05    1.364399
2013-01-06    2.200990
Freq: D, dtype: float64

In [75]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(1)
s

2013-01-01    NaN
2013-01-02    1.0
2013-01-03    3.0
2013-01-04    5.0
2013-01-05    NaN
2013-01-06    6.0
Freq: D, dtype: float64

In [76]:
s.shift(1)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [81]:
s.sub(2)

2013-01-01    NaN
2013-01-02   -1.0
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    NaN
2013-01-06    4.0
Freq: D, dtype: float64

In [86]:
df.apply(lambda x: x.max() - x.min())

a    2.259701
b    1.991462
c    1.568407
d    1.744096
dtype: float64

In [88]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    1
2    6
3    6
4    5
5    4
6    6
7    0
8    2
9    6
dtype: int32

In [89]:
s.value_counts()

6    4
2    2
5    1
4    1
1    1
0    1
dtype: int64

In [90]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [92]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.024164 -0.417578 -1.140429 -1.087101
1 -0.780785  0.045224 -0.523631 -0.259915
2  0.332225  0.131092 -0.706024 -0.879287
3  0.398915  1.289178 -0.541889  0.718566
4  0.242911 -1.333827  1.491508 -0.100329
5 -1.371243 -0.016902 -0.552417 -0.980523
6  0.748753  0.021886  1.394368 -0.554789
7 -0.066745  1.601758  1.736897  0.446139
8 -1.549969  1.031159 -0.998271  0.350496
9 -0.434510 -0.552124 -0.182698 -1.369797

In [94]:
pd.concat([df[0:3],df[0:3]])

          0         1         2         3
0  0.024164 -0.417578 -1.140429 -1.087101
1 -0.780785  0.045224 -0.523631 -0.259915
2  0.332225  0.131092 -0.706024 -0.879287
0  0.024164 -0.417578 -1.140429 -1.087101
1 -0.780785  0.045224 -0.523631 -0.259915
2  0.332225  0.131092 -0.706024 -0.879287

In [95]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [96]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [99]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.161282 -2.403281  0.547728  0.347066
1 -2.103712  0.287716 -1.624062  0.154409
2 -1.449936  0.631075 -0.269251 -0.127792
3  0.318679  1.183754  0.708893  0.864770
4 -1.460473  0.203700 -0.674774 -0.675863
5 -0.322459  0.143201 -1.051704  0.483030
6  0.566511 -1.094516  0.517619  1.099874
7  0.433997 -1.334045 -1.613921  0.624049

In [101]:
s = df.iloc[2]
s

A   -1.449936
B    0.631075
C   -0.269251
D   -0.127792
Name: 2, dtype: float64

In [102]:
df.append(s)

          A         B         C         D
0 -0.161282 -2.403281  0.547728  0.347066
1 -2.103712  0.287716 -1.624062  0.154409
2 -1.449936  0.631075 -0.269251 -0.127792
3  0.318679  1.183754  0.708893  0.864770
4 -1.460473  0.203700 -0.674774 -0.675863
5 -0.322459  0.143201 -1.051704  0.483030
6  0.566511 -1.094516  0.517619  1.099874
7  0.433997 -1.334045 -1.613921  0.624049
2 -1.449936  0.631075 -0.269251 -0.127792

In [103]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.113040 -2.195758
1  bar    one -0.079105 -0.056520
2  foo    two -0.832718 -1.343460
3  bar  three  1.564112  0.906203
4  foo    two -0.337981  0.400661
5  bar    two -1.523855  0.327806
6  foo    one  0.340045 -0.038316
7  foo  three -2.306880 -0.792129

In [105]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.079105 -0.056520
    three  1.564112  0.906203
    two   -1.523855  0.327806
foo one    0.227005 -2.234074
    three -2.306880 -0.792129
    two   -1.170699 -0.942800